0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	back
	{
		type		fixedValue;
		value		uniform (0 0 0);
	}

	front
	{
		type		fixedValue;
		value		uniform (0 0 0);	
	}

	sides
	{
		type		fixedValue;
		value		uniform (0 0 0);
	}

	top
	{
		type		zeroGradient;
	}

	bottom
	{
		type		zeroGradient;
	}

	body
	{
		type		noSlip;
	}

	inlet
	{
		type            fixedValue;
		value		uniform (0 0.034 0);
	}

	/*outlet
	{
		type		zeroGradient;
	}*/		
}

// ************************************************************************* //
