system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(-0.01 -0.038 -0.01)  //0
	(0.01 -0.038 -0.01)//(0.0174 -0.038 -0.0007) //1
	(0.01 0.057 -0.01) //2
	(-0.01 0.057 -0.01)   //3

	(-0.01 -0.038 0.01)   //4
	(0.01 -0.038 0.01)    //5
	(0.01 0.057 0.01)     //6
	(-0.01 0.057 0.01)    //7
);

blocks
(
	//hex (0 1 2 3 4 5 6 7) (3 15 3) simpleGrading (1 1 1)
	hex (0 1 2 3 4 5 6 7) (6 30 6) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    back
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    front
    {
	type patch;
	faces
	(
	    (2 5 6 1)
	);
    }

    sides
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
 
    top
    {
	type patch;
	faces
	(
	    (4 5 6 7)
	);
    }

    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
