system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          1; //1e-06;

writeControl    adjustableRunTime; //runTime;

writeInterval   10; //0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression on;//off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

//maxCo 		0.5;

//adjustTimeStep yes;

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

    /*inMassFlow
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

        //writeControl     outputTime;
	writeControl   timeStep;
	writeInterval  1;

        log             true;

        writeFields     false;

        regionType          patch;
        name		inlet;
	
	operation       sum;
        fields
        (
            phi
        );
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
    
    outMassFlow
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;

	//writeControl     outputTime;

	writeControl   timeStep;
	writeInterval  1;

        log             yes;

        writeFields     false;

        //writeFields     true;
        //surfaceFormat   raw;

        regionType          patch;
        name		    outBox; 

	regionType		patch;
	name			inBox; 

	regionType		patch;
	name			bottomBox; 

	regionType		patch;
	name			topBox; 

	regionType		patch;
	name			sideBox;
	
	operation       sum;
        fields
        (
            phi
        );
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

    fieldAverage
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         false;
        writeControl   outputTime;

        //writeControl   timeStep;
	//writeInterval  100;

	//cleanRestart true;

        timeStart       20;
        timeEnd         1000;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

forces_object
{
	type forces;
	functionObjectLibs ("libforces.so");

	//writeControl outputTime;
	writeControl   timeStep;
	writeInterval  1;

	enabled true;

	//// Patches to sample
	patches ("wall.*");

	//// Name of fields
	pName p;
	Uname U;

	//// Density
	rho rhoInf;
	rhoInf 1.225;

	//// Centre of rotation
	CofR (0 0 0);
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

/*
forceCoeffs_object
{
	// rhoInf - reference density
	// CofR - Centre of rotation
	// dragDir - Direction of drag coefficient
	// liftDir - Direction of lift coefficient
	// pitchAxis - Pitching moment axis
	// magUinf - free stream velocity magnitude
	// lRef - reference length
	// Aref - reference area
	type forceCoeffs;
	functionObjectLibs ("libforces.so");
	patches ("outerBox");
	patches ("symmetricWall");

	pName p;
	Uname U;
	rho rhoInf;
	rhoInf 1.0;

	//// Dump to file
	log true;

	CofR (0.0 0 0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 1.0;
	lRef 1.0;         // reference lenght
	Aref 2.0;         // reference area 1 for 2d

        writeControl   timeStep;
        writeInterval  1;
}


///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

minmaxdomain
{
	type fieldMinMax;

	functionObjectLibs ("libfieldFunctionObjects.so");

	enabled true;

	mode component;

	writeControl timeStep;
	writeInterval 1;

	log true;

	fields (p U);
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
yplus
{
    type                yPlus;
    functionObjectLibs  ("libutilityFunctionObjects.so");

    enabled true;

    writeControl outputTime;
    //writeControl timeStep;
    //writeInterval 1;

    //log true;
}
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
probes
{
	type	probes;
	functionObjectLibs	("libsampling.so");
	setFormat	foamFile;
	writeControl	timeStep;
	writeInterval	50;
	interpolationScheme	cellPoint;
	fields	(U);
	probeLocations
	(
		(0.0868608 0.0187196 0.0) //lower
		(0.0868608 0.309252 0.0) //upper
		(0.0868608 0.172001 0.0) //center
	);
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
residuals
{
	type            residuals;
	functionObjectLibs ("libutilityFunctionObjects.so");
	enabled         true;
	writeControl   timeStep;
	writeInterval  1;

	fields
	(
		p
		U
	);
}*/
///////////////////////////////////////////////////////////////////////////
};
