system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
/*
        solver          PCG;
	preconditioner 	DIC;
	tolerance	1e-8; //1e-8;
        relTol		0.01; //0;
*/

        solver          GAMG;
        tolerance       1e-08;
        relTol          0.001;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;

	//minIter 	3;
    }

    "(U)"
    {
        solver          PBiCG;
        //solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.001;

/*
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0;
*/


	//minIter		3;
    }

    omega
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    k
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    //consistent yes;

    pRefCell 0;
    pRefValue 0;

    residualControl
    {
        p               1e-6; //1e-6;
        U               1e-6; //1e-6;
    }
}

relaxationFactors
{

    fields
    {
        p               0.5;//0.3;
    }
    equations
    {
        U               0.8;//0.7;
    }
/*

    fields
    {
        p               0.6; //1;
    }
    equations
    {
        p               0.6; //1;
        U               0.9;
    }
*/

}

// ************************************************************************* //
